![group by](./pg_group_by.png)

```
SELECT 
   column_1, 
   column_2,
   ...,
   aggregate_function(column_3)
FROM 
   table_name
GROUP BY 
   column_1,
   column_2,
   ...;
```

In [8]:
import common.ipynb_importer
from db.pg.pg_00_common import *

cursor = pg_connect()

In [12]:
sql = """
SELECT 
  *
FROM 
  payment
"""

run_sql(cursor, sql)

       payment_id  customer_id  staff_id  rental_id amount  \
0           17503          341         2       1520   7.99
1           17504          341         1       1778   1.99
2           17505          341         1       1849   7.99
3           17506          341         2       2829   2.99
4           17507          341         2       3130   7.99
...           ...          ...       ...        ...    ...
14591       32094          245         2      12682   2.99
14592       32095          251         1      14107   0.99
14593       32096          252         2      13756   4.99
14594       32097          263         1      15293   0.99
14595       32098          264         2      14243   2.99

                    payment_date
0     2007-02-15 22:25:46.996577
1     2007-02-16 17:23:14.996577
2     2007-02-16 22:41:45.996577
3     2007-02-19 19:39:56.996577
4     2007-02-20 17:31:48.996577
...                          ...
14591 2007-05-14 13:44:29.996577
14592 2007-05-14 13:44:29.996577
14593 2007-05-14 13:44:29.996577
14594 2007-05-14 13:44:29.996577
14595 2007-05-14 13:44:29.996577

[14596 rows x 6 columns]

In [10]:
sql = """
SELECT 
  customer_id,
  amount
FROM 
  payment 
GROUP BY 
  customer_id,
  amount
ORDER BY 
  customer_id;
"""

run_sql(cursor, sql)

      customer_id amount
0               1   1.99
1               1   3.99
2               1   5.99
3               1   4.99
4               1   7.99
...           ...    ...
4672          599   1.99
4673          599   9.99
4674          599   2.99
4675          599   0.99
4676          599   6.99

[4677 rows x 2 columns]

In [4]:
sql = """
SELECT 
  customer_id, 
  SUM (amount) 
FROM 
  payment 
GROUP BY 
  customer_id 
ORDER BY 
  customer_id;
"""

run_sql(cursor, sql)

     customer_id     sum
0              1  114.70
1              2  123.74
2              3  130.76
3              4   81.78
4              5  134.65
..           ...     ...
594          595  110.71
595          596   73.78
596          597   87.77
597          598   83.78
598          599   78.82

[599 rows x 2 columns]

In [11]:
sql = """
SELECT 
  customer_id, 
  SUM (amount) 
FROM 
  payment 
GROUP BY 
  customer_id 
ORDER BY 
  SUM (amount) DESC;
"""

run_sql(cursor, sql)

     customer_id     sum
0            148  211.55
1            526  208.58
2            178  194.61
3            137  191.62
4            144  189.60
..           ...     ...
594          110   49.88
595          320   47.85
596          248   37.87
597          281   32.90
598          318   27.93

[599 rows x 2 columns]

In [13]:
sql = """
SELECT 
  first_name || ' ' || last_name full_name, 
  SUM (amount) amount 
FROM 
  payment 
  INNER JOIN customer USING (customer_id) 
GROUP BY 
  full_name 
ORDER BY 
  amount DESC;
"""

run_sql(cursor, sql)

           full_name  amount
0       Eleanor Hunt  211.55
1          Karl Seal  208.58
2      Marion Snyder  194.61
3     Rhonda Kennedy  191.62
4         Clara Shaw  189.60
..               ...     ...
594   Tiffany Jordan   49.88
595   Anthony Schwab   47.85
596  Caroline Bowman   37.87
597     Leona Obrien   32.90
598      Brian Wyman   27.93

[599 rows x 2 columns]

In [14]:
sql = """
SELECT
	staff_id,
	COUNT (payment_id)
FROM
	payment
GROUP BY
	staff_id;
"""

run_sql(cursor, sql)

   staff_id  count
0         1   7292
1         2   7304

In [15]:
sql = """
SELECT 
  customer_id, 
  staff_id, 
  SUM(amount) 
FROM 
  payment 
GROUP BY 
  staff_id, 
  customer_id 
ORDER BY 
  customer_id;
"""

run_sql(cursor, sql)

      customer_id  staff_id    sum
0               1         2  53.85
1               1         1  60.85
2               2         2  67.88
3               2         1  55.86
4               3         1  59.88
...           ...       ...    ...
1193          597         2  37.91
1194          598         1  43.90
1195          598         2  39.88
1196          599         1  28.92
1197          599         2  49.90

[1198 rows x 3 columns]

In [16]:
sql = """
SELECT 
  DATE(payment_date) payment_date, 
  SUM(amount) sum 
FROM 
  payment 
GROUP BY 
  DATE(payment_date) 
ORDER BY 
  payment_date DESC;
"""

run_sql(cursor, sql)

   payment_date      sum
0    2007-05-14   514.18
1    2007-04-30  5723.89
2    2007-04-29  2717.60
3    2007-04-28  2622.73
4    2007-04-27  2673.57
5    2007-04-26   347.21
6    2007-04-12  1930.48
7    2007-04-11  1940.32
8    2007-04-10  1973.18
9    2007-04-09  2067.86
10   2007-04-08  2227.84
11   2007-04-07  1984.28
12   2007-04-06  2077.14
13   2007-04-05   273.36
14   2007-03-23  2342.43
15   2007-03-22  2586.79
16   2007-03-21  2868.27
17   2007-03-20  2669.89
18   2007-03-19  2617.69
19   2007-03-18  2701.76
20   2007-03-17  2442.16
21   2007-03-16   299.28
22   2007-03-02  2550.05
23   2007-03-01  2808.24
24   2007-02-21   917.87
25   2007-02-20  1219.09
26   2007-02-19  1290.90
27   2007-02-18  1275.98
28   2007-02-17  1188.17
29   2007-02-16  1154.18
30   2007-02-15  1188.92
31   2007-02-14   116.73